app/controllers/drivers_controller.rb

SELECT "drivers".* FROM "drivers" WHERE "drivers"."user_id" = ?  [["user_id", 4]]
---
  def index
    #  @drivers = Driver.all
      @search  = Search.new(Driver.includes(:user), params[:search], :per_page => 30000)

SELECT  "drivers".* FROM "drivers" WHERE "drivers"."id" = ? LIMIT 1  [["id", 5]]
DELETE FROM "drivers" WHERE "drivers"."id" = ?  [["id", 5]]
---
    def destroy
        @driver = Driver.find(params[:id])
	if current_user == @driver.user
            @driver.destroy

SELECT  "drivers".* FROM "drivers" WHERE "drivers"."id" = ? LIMIT 1  [["id", 6]]
---
    def edit


        @driver = Driver.find(params[:id])

SELECT  "drivers".* FROM "drivers" WHERE "drivers"."id" = ? LIMIT 1  [["id", 6]]
UPDATE "drivers" SET "contact_info" = ?, "updated_at" = ? WHERE "drivers"."id" = ?  [["contact_info", "22222111"], ["updated_at", "2015-10-21 06:54:18.690974"], ["id", 6]]
---
    def update
        @driver = Driver.find(params[:id])
        if @driver.update(driver_params)

INSERT INTO "drivers" ("departure", "destination", "price", "depart_time", "estimated_arrival_time", "description", "car_type", "passenger_num", "contact_info", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create

    @driver = current_user.drivers.build(driver_params)
    @driver.left = @driver.passenger_num
    if  @driver.save

SELECT  "drivers".* FROM "drivers" WHERE "drivers"."id" = ? LIMIT 1  [["id", 1]]
---
  def show
     #@drivers = current_user.drivers
     @driver = Driver.find(params[:id])