app/controllers/hitchers_controller.rb

  def index
     @hitchers = Hitcher.all
---
SELECT "hitchers".* FROM "hitchers"

  def create
    @hitcher = current_user.hitchers.build(hitcher_params)

    if @hitcher.save
---
INSERT INTO "hitchers" ("departure", "destination", "depart_time", "arrival_time", "description", "num", "contact_info", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

    def edit
        @hitcher = Hitcher.find(params[:id])
---
SELECT  "hitchers".* FROM "hitchers" WHERE "hitchers"."id" = ? LIMIT 1  [["id", 8]]

    def update
        @hitcher = Hitcher.find(params[:id])
        if @hitcher.update(hitcher_params)
---
SELECT  "hitchers".* FROM "hitchers" WHERE "hitchers"."id" = ? LIMIT 1  [["id", 8]]
UPDATE "hitchers" SET "contact_info" = ?, "updated_at" = ? WHERE "hitchers"."id" = ?  [["contact_info", "123123"], ["updated_at", "2015-10-21 06:59:56.683509"], ["id", 8]]

  def show
     @hitcher = Hitcher.find(params[:id])
---
SELECT  "hitchers".* FROM "hitchers" WHERE "hitchers"."id" = ? LIMIT 1  [["id", 1]]

  def destroy
     @hitcher = Hitcher.find(params[:id])
     @hitcher.destroy
---
SELECT  "hitchers".* FROM "hitchers" WHERE "hitchers"."id" = ? LIMIT 1  [["id", 4]]
DELETE FROM "hitchers" WHERE "hitchers"."id" = ?  [["id", 4]]