app/controllers/users_controller.rb

INSERT INTO "users" ("name", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "fdsaf"], ["password_digest", "$2a$10$MmZmYdcMKonK9lbf9z.oge/wqrAu4tiKwU8GQwPUhKjG32b3OT/pi"], ["created_at", "2015-10-18 23:29:18.953934"], ["updated_at", "2015-10-18 23:29:18.953934"]]
---
    def create
        @user = User.new(user_params)
        if @user.save